cf/DataProcessors/MonthEnd.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<DataProcessor>
		<Properties>
			<Name>MonthEnd</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Period</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Company</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Companies</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/Enums/YesNo.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.2">
	<Enum>
		<Properties>
			<Name>YesNo</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Yes</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>No</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/DataProcessors/MonthEnd/Forms/PostponeEditProhibitionDate/Ext/Form/Module.bsl
&AtClient
Procedure Yes(Command)
	
	If DontAskAgain Then
		SetDoNotAskAnyMore(True);
	EndIf;
	
	Close(DialogReturnCode.Yes);
	
EndProcedure

&AtClient
Procedure No(Command)
	
	If DontAskAgain Then
		SetDoNotAskAnyMore(False);
	EndIf;
	
	Close();
	
EndProcedure

&AtServerNoContext
Procedure SetDoNotAskAnyMore(YesNoSettingVariant)
	
	If YesNoSettingVariant Then
		Constants.PostponeEditProhibitionDate.Set(Enums.YesNo.Yes);
	Else
		Constants.PostponeEditProhibitionDate.Set(Enums.YesNo.No);
	EndIf;
	
EndProcedure



// Rise { Popov N 2016-05-25
&AtClient
Function RiseGetFormInterfaceClient() Export
	Return RiseGetFormInterface();
EndFunction

&AtServer
Function RiseGetFormInterface()
	Return RiseTranslation.GetFormInterface(ThisForm);
EndFunction
// Rise } Popov N 2016-05-25
